brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "cairo"
brew "fd"
brew "fzf"
brew "giflib"
brew "git"
brew "go-task"
brew "jq"
brew "jpeg"
brew "keychain"
brew "librsvg"
brew "lz4"
brew "n"
brew "pango"
brew "pkgconf"
brew "postgresql@14"
brew "pyenv", args: ["HEAD"]
brew "ripgrep"
brew "telnet"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "warrensbox/tap/tfswitch"
brew "watchexec"
brew "yq"
brew "zstd"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "signal"
cask "slack"
cask "whatsapp"
tap "homebrew/bundle"
tap "warrensbox/tap"
