# Homebrew packages - User installed only
# Generated: 2026-02-18

# Custom taps
tap "charmbracelet/tap"
tap "getsentry/tools"
tap "hashicorp/tap"
tap "mutagen-io/mutagen"
tap "textualize/homebrew"
tap "warrensbox/tap"

# Formulae (user installed)
brew "aws-elasticbeanstalk"
brew "awscli"
brew "bash-completion@2"
brew "caddy"
brew "coreutils"
brew "dive"
brew "dnsmasq"
brew "fd"
brew "figlet"
brew "fzf"
brew "getsentry/tools/sentry-cli"
brew "gh"
brew "git"
brew "go-task"
brew "hashicorp/tap/packer"
brew "htop"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "keychain"
brew "mkcert"
brew "mutagen-io/mutagen/mutagen"
brew "mysql@8.0"
brew "n"
brew "nvm"
brew "pandoc"
brew "php@8.3"
brew "pigz"
brew "postgresql@14"
brew "pv"
brew "pyenv", args: ["HEAD"]
brew "python@3.12"
brew "qcachegrind"
brew "rsync"
brew "rtmpdump"
brew "siege"
brew "step"
brew "stow"
brew "telnet"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "warrensbox/tap/tfswitch"
brew "watch"
brew "watchexec"
brew "wget"
brew "yarn"
brew "yq"

# Casks
cask "bitwarden"
cask "codex"
cask "dbeaver-community"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "firefox"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "meld"
cask "mysql-shell"
cask "mysqlworkbench"
cask "ngrok"
cask "orbstack"
cask "sequel-ace"
cask "signal"
cask "slack"
cask "whatsapp"
