# Homebrew packages - User installed only
# Generated: 2026-06-09

# Custom taps
tap "charmbracelet/tap"
tap "getsentry/tools"
tap "hashicorp/tap"
tap "mutagen-io/mutagen"
tap "oven-sh/bun"
tap "textualize/homebrew"
tap "warrensbox/tap"

# Formulae
brew "aws-elasticbeanstalk"
brew "awscli"
brew "bash-completion@2"
brew "bat"
brew "btop"
brew "caddy"
brew "coreutils"
brew "ctags"
brew "dive"
brew "dnsmasq", restart_service: true
brew "duf"
brew "eza"
brew "fd"
brew "figlet"
brew "fzf"
brew "getsentry/tools/sentry-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "go-task"
brew "hashicorp/tap/packer"
brew "htop"
brew "jpeg"
brew "jq"
brew "keychain"
brew "lua@5.4"
brew "mkcert"
brew "mutagen-io/mutagen/mutagen"
brew "mysql@8.0"
brew "n"
brew "nmap"
brew "nvm"
brew "oven-sh/bun/bun"
brew "pandoc"
brew "php@8.3"
brew "pigz"
brew "pv"
brew "pyenv", args: ["HEAD"]
brew "python@3.12"
brew "python@3.13"
brew "qcachegrind"
brew "rsync"
brew "rtk"
brew "rtmpdump"
brew "ruby"
brew "shared-mime-info"
brew "shellcheck"
brew "siege"
brew "ssh-audit"
brew "step"
brew "stow"
brew "telnet"
brew "tflint"
brew "tfsec"
brew "tmux"
brew "tree"
brew "unbound"
brew "uv"
brew "vim"
brew "warrensbox/tap/tfswitch"
brew "watch"
brew "watchexec"
brew "wget"
brew "yarn"
brew "yq"
brew "zbar"
brew "zoxide"

# Casks
cask "bitwarden"
cask "charles"
cask "chatgpt"
cask "claude-code"
cask "codex"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "docker-desktop"
cask "dropbox"
cask "firefox"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "linear"
cask "linear-linear"
cask "meld"
cask "mysql-shell"
cask "mysqlworkbench"
cask "netnewswire"
cask "obsidian"
cask "openvpn-connect"
cask "orbstack"
cask "postman"
cask "sequel-ace"
cask "signal"
cask "slack"
cask "tfswitch"
cask "virtualbox"
cask "whatsapp"

